In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(dict(
                       age=[1,2,3],
                        born = [pd.NaT, pd.Timestamp('1981-06-05'),pd.Timestamp('2009-06-04')],
                        name = ['Aaroh','Hemant','Arushi'],
                        toy = [None,'Bat','Ball']
                     )
                 )

In [3]:
df

   age       born    name   toy
0    1        NaT   Aaroh  None
1    2 1981-06-05  Hemant   Bat
2    3 2009-06-04  Arushi  Ball

In [4]:
df.isna()

     age   born   name    toy
0  False   True  False   True
1  False  False  False  False
2  False  False  False  False

In [5]:
df.isna().sum()

age     0
born    1
name    0
toy     1
dtype: int64

In [8]:
df = df.dropna()

In [9]:
df

   age       born    name   toy
1    2 1981-06-05  Hemant   Bat
2    3 2009-06-04  Arushi  Ball